In [1]:
import pandas as pd
import seaborn as sb

In [2]:
df=pd.read_csv(r"E:\Oasis Infobyte Internship\Project 1\Data\Data set 2.csv")
df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   object
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
dtypes: int64(5), object(4)
memory usage: 70.4+ KB

In [4]:
df.describe()

       Transaction ID         Age     Quantity  Price per Unit  Total Amount
count     1000.000000  1000.00000  1000.000000     1000.000000   1000.000000
mean       500.500000    41.39200     2.514000      179.890000    456.000000
std        288.819436    13.68143     1.132734      189.681356    559.997632
min          1.000000    18.00000     1.000000       25.000000     25.000000
25%        250.750000    29.00000     1.000000       30.000000     60.000000
50%        500.500000    42.00000     3.000000       50.000000    135.000000
75%        750.250000    53.00000     4.000000      300.000000    900.000000
max       1000.000000    64.00000     4.000000      500.000000   2000.000000

In [5]:
# our data clean .. so lets make some new columns

In [6]:
import numpy as np

# Create age category column using numpy.where for vectorized conditional assignment
df['age category'] = np.where((df['Age'] >= 18) & (df['Age'] <= 30), 'youth',
                     np.where((df['Age'] >= 31) & (df['Age'] <= 40), 'middle age',
                     np.where((df['Age'] >= 41) & (df['Age'] <= 50), 'senior', 'old age')))

df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,age category
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150,middle age
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000,youth
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30,senior
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500,middle age
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100,youth

In [7]:
df['Date'] = pd.to_datetime(df['Date'])

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   datetime64[ns]
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
 9   age category      1000 non-null   object
dtypes: datetime64[ns](1), int64(5), object(4)
memory usage: 78.3+ KB

In [9]:
df.drop_duplicates()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,age category
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150,middle age
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000,youth
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30,senior
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500,middle age
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100,youth
...,...,...,...,...,...,...,...,...,...,...
995,996,2023-05-16,CUST996,Male,62,Clothing,1,50,50,old age
996,997,2023-11-17,CUST997,Male,52,Beauty,3,30,90,old age
997,998,2023-10-29,CUST998,Female,23,Beauty,4,25,100,youth
998,999,2023-12-05,CUST999,Female,36,Electronics,3,50,150,middle age
999,1000,2023-04-12,CUST1000,Male,47,Electronics,4,30,120,senior

In [10]:
df['Client category'] = np.where((df['Price per Unit'] >= 25) & (df['Price per Unit'] <= 30), 'Normal Client',
                     np.where((df['Price per Unit'] >= 31) & (df['Price per Unit'] <= 50), 'Loyal Client',
                     np.where((df['Price per Unit'] >= 51) & (df['Price per Unit'] <= 70), 'Gold Client',
                     np.where((df['Price per Unit'] >= 71) & (df['Price per Unit'] <= 80), 'Platinum Client',
                    np.where((df['Price per Unit'] >= 81), 'VIP Client', 'Unknown')))))
df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,age category,Client category
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150,middle age,Loyal Client
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000,youth,VIP Client
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30,senior,Normal Client
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500,middle age,VIP Client
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100,youth,Loyal Client

In [12]:
df.to_csv(r'E:\Oasis Infobyte Internship\Project 1\Data\Cleand_data_set_2.csv', index=False)